Repository: leonodev/fintechKids-modulo-authentication-ios
Catalog: Sources/FHKAuth/Resources/Localizable.xcstrings
Source language: en
Languages: es

# EMAIL_SUGGESTION_CONSECUTIVE_DOTS
source: Remove consecutive dots in the email
es: Elimina los puntos consecutivos en el email

# EMAIL_SUGGESTION_EMPTY
source: Please enter your email address
es: Por favor, ingresa tu dirección de email

# EMAIL_SUGGESTION_INVALID_DOMAIN
source: Domain must be valid, example: gmail.com, hotmail.com, etc.
es: El dominio debe ser válido, ejemplo: gmail.com, hotmail.com, etc.

# EMAIL_SUGGESTION_INVALID_FORMAT
source: Make sure the email has the correct format: name@domain.extension
es: Verifica que el email tenga el formato correcto: nombre@dominio.extension

# EMAIL_SUGGESTION_INVALID_LOCAL_PART
source: Use only letters, numbers, dots, hyphens or underscores before the @
es: Usa solo letras, números, puntos, guiones o guiones bajos antes del @

# EMAIL_SUGGESTION_MISSING_AT
source: Make sure to include the @ symbol in your email
es: Asegúrate de incluir el símbolo @ en tu email

# EMAIL_SUGGESTION_MISSING_DOMAIN
source: Complete the domain part after the @
es: Completa la parte del dominio después del @

# EMAIL_SUGGESTION_STARTING_ENDING_DOT
source: Remove the dot at the beginning or end of the email
es: Elimina el punto al inicio o final del email

# EMAIL_SUGGESTION_TOO_LONG
source: Use a shorter email address
es: Usa una dirección de email más corta

# EMAIL_VALIDATION_CONSECUTIVE_DOTS
source: Email cannot contain consecutive dots
es: El email no puede contener puntos consecutivos

# EMAIL_VALIDATION_EMPTY
source: Email field cannot be empty
es: El campo de email no puede estar vacío

# EMAIL_VALIDATION_INVALID_DOMAIN
source: Email domain is invalid
es: El dominio del email es inválido

# EMAIL_VALIDATION_INVALID_FORMAT
source: Email format is not valid. Example: user@domain.com
es: El formato del email no es válido. Ejemplo: usuario@dominio.com

# EMAIL_VALIDATION_INVALID_LOCAL_PART
source: Local part of email (before @) contains invalid characters
es: La parte local del email (antes del @) contiene caracteres no válidos

# EMAIL_VALIDATION_MISSING_AT
source: Email must contain the @ symbol
es: El email debe contener el símbolo @"

# EMAIL_VALIDATION_MISSING_DOMAIN
source: Email domain is invalid or incomplete
es: El dominio del email es inválido o está incompleto

# EMAIL_VALIDATION_STARTING_ENDING_DOT
source: Email cannot start or end with a dot
es: El email no puede comenzar o terminar con un punto

# EMAIL_VALIDATION_TOO_LONG
source: Email cannot be longer than %lld characters
es: El email no puede tener más de %lld caracteres

# EMAIL_VALIDATION_VALID
source: Valid email
es: Email válido
